madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32.h
#pragma once

#if (TARGET_BOARD != STM32_BOARD)
  #error "Target board MUST BE STM32_BOARD for this configuration!"
#endif

//--------------------------------------------------------------------------------------------------------------------------------
#include "REG_KEY.h" // подключаем данные регистрационного ключа
//--------------------------------------------------------------------------------------------------------------------------------
// настройки альтернативного модуля управления фрамугами
//--------------------------------------------------------------------------------------------------------------------------------
#define WM_BACK_CAPTION "< НАЗАД"
#define WM_SAVE_CAPTION "СОХРАНИТЬ"
#define WM_WINDOWS_CAPTION "0 ФРАМУГИ"
#define WM_SCENE_BUTTON_CAPTION "9 СЦЕНАРИИ" 
#define WM_RAIN_CAPTION "ДАТЧИК ДОЖДЯ"
#define WM_WIND_CAPTION "ДАТЧИК ВЕТРА"
#define WM_OPTIONS_CAPTION "1 ОПЦИИ"
#define WM_T25_CAPTION "^ открытия 25%"
#define WM_T50_CAPTION "^ открытия 50%"
#define WM_T75_CAPTION "^ открытия 75%"
#define WM_T100_CAPTION "^ открытия 100%"
#define WM_HISTERESIS_CAPTION "Гистерезис"
#define WM_SENSOR_CAPTION "Датчик N"
#define WM_ON_CAPTION "МОДУЛЬ ВКЛ"
#define WM_OFF_CAPTION "МОДУЛЬ ВЫКЛ"
#define WM_TSECTION_1_CAPTION "^ секции N1"
#define WM_TSECTION_2_CAPTION "^ секции N2"
#define WM_TSECTION_3_CAPTION "^ секции N3"
#define WM_TSECTION_4_CAPTION "^ секции N4"
#define WM_WLIST_CAPTION "ОКНA ПО СЕКЦИЯМ"
#define WM_CLOCK_CAPTION "6 ЧАСЫ И ПР."
//#define WM_ENTERKEY_CAPTION "ВВОД КЛЮЧА"
//#define RESTRICTED_FEATURES F("ОГРАНИЧЕННАЯ ВЕРСИЯ")
#define UNAVAIL_FEATURE F("НЕДОСТУПНО")
#define WTRFLOW_CAPTION1 "РАСХОД ВОДЫ #1"
#define WTRFLOW_CAPTION2 "РАСХОД ВОДЫ #2"
#define WINDSPEED_CAPTION "ВЕТЕР"
#define WINDSPEED_DIRECTION_CAPTION "НАПРАВЛЕНИЕ"
#define RAIN_BOX_CAPTION "ДОЖДЬ"
#define RAIN_BOX_YES "ЕСТЬ"
#define RAIN_BOX_NO "НЕТ"
#define WM_DRIVE_CAPTION "8 УПРАВЛЕНИЕ"
#define WM_WATERING_CAPTION "4 ПОЛИВ"
#define WM_LIGHT_CAPTION "5 ДОСВЕТКА"

#define WS_25_CAPTION "ОТКРЫТИЕ НА 25%"
#define WS_50_CAPTION "ОТКРЫТИЕ НА 50%"
#define WS_75_CAPTION "ОТКРЫТИЕ НА 75%"
#define WS_100_CAPTION "ОТКРЫТИЕ НА 100%"

#define FLOW_CONTROL_BUTTON "2РАСХОДОМЕРЫ"
#define FLOW_RESET_BUTTON1 "СБРОСИТЬ РАСХОД #1"
#define FLOW_RESET_BUTTON2 "СБРОСИТЬ РАСХОД #2"
#define FLOW_CAL1_CAPTION "Калибровка #1"
#define FLOW_CAL2_CAPTION "Калибровка #2"

#define WM_WIND_SPEED_CAPTION "Порог закрытия, м/с"
#define WM_HURRICANE_SPEED_CAPTION "Ураган, м/с"

#define WM_ORIENTATION_CAPTION "ОРИЕНТАЦИЯ ОКОН"
#define WM_NORTH_CAPTION "Север"
#define WM_SOUTH_CAPTION "Юг"
#define WM_EAST_CAPTION "Восток"
#define WM_WEST_CAPTION "Запад"

#define WM_LIGHT_BEGIN_H_CAPTION "Начало, ч:"
#define WM_LIGHT_BEGIN_DH_CAPTION "Длительность, ч:"
#define WM_LIGHT_LUM_CAPTION "Порог, люкс:"
#define WM_LIGHT_HISTERESIS_CAPTION "Гистерезис:"

#define WM_RAIN_CLOSE_CAPTION "Закрыть"
#define WM_RAIN_BGCOLOR 0x0400
#define WM_RAIN_FONT_COLOR WHITE

#define WM_SECTION_NOLINK_CAPTION "-"
#define WM_SECTION_LINK1_CAPTION "Секция 1"
#define WM_SECTION_LINK2_CAPTION "Секция 2"
#define WM_SECTION_LINK3_CAPTION "Секция 3"
#define WM_SECTION_LINK4_CAPTION "Секция 4"
#define WM_SECTION_LABEL_PREFIX "Окно #"

#define CYCLE_VENT_BUTTON_CAPTION "<ВОЗДУХООБМЕН"
#define CYCLE_VENT_SCREEN_CAPTION "ВОЗДУХООБМЕН"

#define CHANNEL_N_1_CAPTION "КАНАЛ #1"
#define CHANNEL_N_2_CAPTION "КАНАЛ #2"
#define CHANNEL_N_3_CAPTION "КАНАЛ #3"
#define CYCLE_VENT_STIME_CAPTION "НАЧАЛО:"
#define CYCLE_VENT_ETIME_CAPTION "КОНЕЦ:"
#define CYCLE_VENT_WTIME_CAPTION "РАБОТА, МИН:"
#define CYCLE_VENT_ITIME_CAPTION "ОТДЫХ, МИН:"


#define VENT_BUTTON_CAPTION "= ВЕНТИЛЯЦИЯ"
#define VENT_SCREEN_CAPTION "ВЕНТИЛЯЦИЯ"

#define VENT_MIN_WORKTIME_CAPTION "Мин. выбег, мин:сек:"
#define VENT_MAX_WORKTIME_CAPTION "Макс. выбег, мин:сек:"
#define VENT_REST_TIME_CAPTION "Отдых, мин:сек:"
#define VENT_SENSOR_CAPTION "Датчик:"
#define VENT_TEMP_CAPTION "Порог температуры:"
#define VENT_HISTERESIS_CAPTION "Гистерезис:"
#define VENT_MAX_WORK_TIME 5999l


#define THERMOSTAT_BUTTON_CAPTION "> ТЕРМОСТАТ"
#define THERMOSTAT_SCREEN_CAPTION "ТЕРМОСТАТ"

#define THERMOSTAT_SENSOR_CAPTION "Датчик:"
#define THERMOSTAT_TEMP_CAPTION "Температура:"
#define THERMOSTAT_HISTERESIS_CAPTION "Гистерезис:"

#define CONTROL_PH_CAPTION "?КОНТРОЛЬ pH"
#define CONTROL_PH_SCREEN_CAPTION "КОНТРОЛЬ pH"

#define CONTROL_CO2_CAPTION "КОНТРОЛЬ CO2"


#define WM_BLINK_ON_TEXT_COLOR WHITE
#define WM_BLINK_OFF_TEXT_COLOR 0x3A8D
#define WM_ON_BLINK_BGCOLOR MAROON
#define WM_OFF_BLINK_BGCOLOR LGRAY

#define WM_SECTION_1_BGCOLOR YELLOW
#define WM_SECTION_1_FONT_COLOR BLACK

#define WM_SECTION_2_BGCOLOR GREEN
#define WM_SECTION_2_FONT_COLOR WHITE

#define WM_SECTION_3_BGCOLOR BLUE
#define WM_SECTION_3_FONT_COLOR WHITE

#define WM_SECTION_4_BGCOLOR MAROON
#define WM_SECTION_4_FONT_COLOR WHITE

// скорости ветра по умолчанию, м/с
#define WM_DEFAULT_WIND_SPEED 15
#define WM_DEFAULT_HURRICANE_SPEED 20

// температуры открытия по умолчанию
#define WM_25PERCENTS_OPEN_TEMP 26
#define WM_50PERCENTS_OPEN_TEMP 28
#define WM_75PERCENTS_OPEN_TEMP 30
#define WM_100PERCENTS_OPEN_TEMP 32
#define WM_DEFAULT_HISTERESIS 5 // гистерезис по умолчанию, десятые доли, шаг - 5 десятых
#define WM_ACTIVE_FLAG true // признак активности модуля управления окнами, по умолчанию

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления отоплением
//--------------------------------------------------------------------------------------------------------------------------------
#define HEAT_BUTTON_CAPTION "7 ОТОПЛЕНИЕ"
#define HEAT_BUTTON_CAPTION1 "КОНТУР ВЕРХНИЙ"
#define HEAT_BUTTON_CAPTION2 "КОНТУР БОКОВОЙ"
#define HEAT_BUTTON_CAPTION3 "КОНТУР ПОЧВА"
#define HEAT_MIN_TEMP_CAPTION "Мин. ^ контура"
#define HEAT_MAX_TEMP_CAPTION "Макс. ^ контура"
#define HEAT_ETHALON_TEMP_CAPTION "^ климата"
#define HEAT_HISTERESIS_CAPTION "Гистерезис"
#define HEAT_SENSOR_CAPTION "Контур Д"
#define HEAT_AIR_CAPTION "Климат Д"
#define HEAT_WORKTIME_CAPTION "Работа привода, с"
#define HEAT_AIR "ВОЗДУХ"

#define HEAT_INFO_BOX_CONTOUR "Контур:"
#define HEAT_INFO_BOX_MODULE "Модуль:"

#define HEAT_INFO_BOX_CONTOUR_ON "ВКЛ"
#define HEAT_INFO_BOX_CONTOUR_OFF "ВЫКЛ"

#define HEAT_INFO_BOX_MODULE_ON "вкл"
#define HEAT_INFO_BOX_MODULE_OFF "выкл"

#define HEAT_DRIVE_CHANNEL_ON "ВКЛЮЧЕН"
#define HEAT_DRIVE_CHANNEL_OFF "ВЫКЛЮЧЕН"


