madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32.h
#define HEAT_DEFAULT_MIN_TEMP 15
#define HEAT_DEFAULT_MAX_TEMP 90
#define HEAT_DEFAULT_ETHALON_TEMP 25
#define HEAT_DEFAULT_HISTERESIS 20

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля затенения
//--------------------------------------------------------------------------------------------------------------------------------
#define WM_SHADOW_CAPTION "3 ЗАТЕНЕНИЕ"
#define SHADOW_BUTTON_CAPTION1 "ШТОРА #1"
#define SHADOW_BUTTON_CAPTION2 "ШТОРА #2"
#define SHADOW_BUTTON_CAPTION3 "ШТОРА #3"
#define SHADOW_WORKTIME_CAPTION "Работа привода, с"
#define SHADOW_HISTERESIS_CAPTION "Гистерезис"
#define SHADOW_BORDER_CAPTION "Порог, люкс"
#define HEAT_SENSORINDEX_CAPTION "Датчик"
#define SHADOW_DRIVE_CHANNEL_ON "РАСКРЫТА"
#define SHADOW_DRIVE_CHANNEL_OFF "ЗАКРЫТА"

//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужно управление окнами по температуре
#define USE_TEMP_SENSORS
#define SUPPORTED_WINDOWS 16 // кол-во поддерживаемых окон, максимум 16 (по два реле на мотор, для 8-ми канального модуля реле - 4 окна)
#define WATER_RELAYS_COUNT 16 // сколько каналов управления поливом используется (максимум - 16)
// уровни для реле каналов полива
#define WATER_RELAY_ON LOW // уровень для включения реле
#define LIGHT_RELAY_ON LOW // уровень для включения реле (можно менять через конфигуратор потом)
#define RELAY_ON LOW // уровень для включения реле фрамуг (можно менять через конфигуратор потом)

//--------------------------------------------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля измерения давления
//--------------------------------------------------------------------------------------------------------------------------------
#define MIN_SEALEVEL_VAL -100
#define MAX_SEALEVEL_VAL 8848
#define PREDICT_MEASURES 10 // какое кол-во измерений давления использовать для предсказания
#define PREDICT_INTERVAL 600000 // интервал между сбором предсказаний по давлению, мс
#define TFT_SEALEVEL_CAPTION "Уровень моря, м:"

//--------------------------------------------------------------------------------------------------------------------------------
// экраны
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TFT_MODULE // закомментировать, если не нужна поддержка TFT с разрешением 800x480

//--------------------------------------------------------------------------------------------------------------------------------
// настройки EEPROM для хранения данных
//--------------------------------------------------------------------------------------------------------------------------------
#define SETT_HEADER1 0x1F // байты, сигнализирующие о наличии сохранённых настроек, первый
#define SETT_HEADER2 0xBF // и второй

//--------------------------------------------------------------------------------------------------------------------------------
// адреса хранения данных в EEPROM (МИНИМАЛЬНЫЙ ОБЪЁМ EEPROM - 16 Кб !!!)
//--------------------------------------------------------------------------------------------------------------------------------

#define CONTROLLER_ID_EEPROM_ADDR 1 // по какому адресу располагается ID контроллера, 1 байт
#define UNI_SENSOR_INDICIES_EEPROM_ADDR 2 // с какого адреса идут выданные индексы для универсальных сенсоров, 10 байт

#define WIFI_STATE_EEPROM_ADDR 12// адрес хранения состояния Wi-Fi (коннектится к роутеру или нет), 1 байт
#define STATION_PASSWORD_EEPROM_ADDR 13// адрес хранения пароля к точке ESP, 20 байт
#define STATION_ID_EEPROM_ADDR 33// адрес хранения ID точки доступа ESP, 20 байт
#define ROUTER_PASSWORD_EEPROM_ADDR 53// адрес хранения пароля к роутеру, 20 байт
#define ROUTER_ID_EEPROM_ADDR 73// адрес хранение ID роутера, 20 байт

#define SMS_NUMBER_EEPROM_ADDR 93 // адрес хранения номера телефона хозяина, 15 байт

// НЕ ИСПОЛЬЗУЕТСЯ !!!
#define GSM_PROVIDER_EEPROM_ADDR 108 // адрес хранения оператора GSM, 1 байт

#define IOT_SETTINGS_EEPROM_ADDR 109 // адрес хранения настроек IOT, 51 байт
#define OPEN_INTERVAL_EEPROM_ADDR 160 // адрес хранения настроек интервала открытия окон, 4 байта
#define CLOSE_TEMP_EEPROM_ADDR 164 // адрес хранения температуры закрытия, 1 байт
#define OPEN_TEMP_EEPROM_ADDR 165 // адрес хранения температуры открытия, 1 байт

#define WATERING_OPTION_EEPROM_ADDR 166 // адрес хранения текущей опции полива, 1 байт
#define TURN_PUMP_EEPROM_ADDR 167 // адрес хранения флага - включить ли насос при поливе, 1 байт
#define START_WATERING_TIME_EEPROM_ADDR 168 // адрес хранения начала полива для всех каналов, 2 байта
#define WATERING_TIME_EEPROM_ADDR 170 // адрес хранения продолжительности полива для всех каналов, 2 байта
#define WATERING_WEEKDAYS_EEPROM_ADDR 172 // адрес хранения маски дней недели полива на всех каналах, 1 байт
#define WATERING_SENSOR_EEPROM_ADDR 173 // адрес хранения индекса датчика в модуле влажности почв, показания с которого учитываются при поливе, 1 байт
#define WATERING_STOP_BORDER_EEPROM_ADDR 174 // адрес хранения показаний с датчика, по которым полив на всех каналах выключается, 1 байт
#define WATERING_CHANNELS_SETTINGS_EEPROM_ADDR 175 // адрес начала настроек каналов полива, 16 каналов*7 байт на канал - 112 байт
#define WATERING_TURN_TO_AUTOMODE_AFTER_MIDNIGHT_ADDRESS 299 // адрес настройки "переходить в авторежим после полуночи", 1 байт
#define WATERING_STATUS_EEPROM_ADDR 300 // с какого адреса у нас идут статусы каналов полива, по 5 байт на канал, 100 байт

#define WATERFLOW_EEPROM_ADDR 400 // с какого адреса у нас будут записываться показания датчиков расхода воды, 12 байт

#define DELTA_SETTINGS_EEPROM_ADDR 412 // с какого адреса в EEPROM начинаются настройки дельт, 500 байт на 20 дельт
#define PH_SETTINGS_EEPROM_ADDR 912 // с какого адреса идут настройки PH-модуля, 30 байт
#define TIMERS_EEPROM_ADDR 942 // у нас 4 таймера, на каждый - 10 байт + заголовок (2 байта), итого - 42 байта 
#define RESERVATION_ADDR 984 // адрес, с которого пишутся настройки резервирования (10 списков по 12 байт + 3 байта = 123 байта)
#define GUID_ADDRESS 1110 // адрес, по которому хранится уникальный GUID контроллера (32 символа без пробелов + 2 байта - заголовок присутствия - 34 байта)
#define HTTP_API_KEY_ADDRESS 1144 // адрес, ко которому хранится ключ доступа к HTTP API (32 символа без пробелов + 2 байта - заголовок присутствия + 1 байт - флаг активности, вкл/выкл) - 35 байт
#define HTTP_SEND_SENSORS_DATA_ADDRESS 1179 // адрес хранения флага - отсылать ли слепок показаний датчиков контроллера при проверке задач по HTTP, 1 байт
#define TIMEZONE_ADDRESS 1180 // адрес хранения часового пояса контроллера, 4 байта (2 байта заголовок присутствия, 2 байта - таймзона). Хранится в минутах
#define HTTP_SEND_STATUS_ADDRESS 1184 // адрес хранения флага - отсылать ли слепок состояния контроллера при проверке задач по HTTP, 1 байт

#define MQTT_ENABLED_FLAG_ADDRESS 1185 // адрес хранения флага - активен ли MQTT-клиент, 1 байт
#define MQTT_INTERVAL_BETWEEN_TOPICS_ADDRESS 1186 // адрес хранения интервала (в секундах) между публикацией топиков в брокер MQTT, 1 байт

#define WM_T25_ADDRESS 1200 // адрес хранения температуры открытия на 25%, 4 байта*4канала
#define WM_T50_ADDRESS 1216 // адрес хранения температуры открытия на 50%, 4 байта*4канала
#define WM_T75_ADDRESS 1232 // адрес хранения температуры открытия на 75%, 4 байта*4канала
#define WM_T100_ADDRESS 1248 // адрес хранения температуры открытия на 100%, 4 байта*4канала
#define WM_HISTERESIS_ADDRESS 1264 // адрес хранения значения гистерезиса, 4 байта*4канала
#define WM_SENSOR_ADDRESS 1280 // адрес хранения индекса датчика, 4 байта*4канала
#define WM_ACTIVE_ADDRESS 1296 // адрес хранения флага активности, 3 байта*4канала
#define WM_BINDING_ADDRESS 1308 // адрес хранения привязок каналов фрамуг к секциям контроля, 18 байт
#define WM_RAIN_BINDING_ADDRESS 1326 // адрес хранения привязок каналов фрамуг к датчику дождя, 18 байт
#define WM_ORIENTATION_BINDING_ADDRESS 1344 // адрес хранения привязок ориентации окон, 18 байт
#define WM_WIND_SPEED_ADDRESS 1362 // адрес хранения уставки скорости ветра, 4 байта
#define WM_HURRICANE_SPEED_ADDRESS 1366 // адрес хранения уставки скорости урагана, 4 байта
#define WM_HEAT_SETTINGS_ADDRESS 1370 // адрес хранения настроек контуров отопления, 15 байт*3 контура
#define WM_HEAT_WORKTIME_ADDRESS  1415 // адрес хранения времени работы приводов отопления, 4 байта*3 контура
#define WM_SEALEVEL_ADDRESS 1450 // адрес хранения значения высоты над уровнем моря, 4 байта
#define WM_SHADOW_WORKTIME_ADDRESS  1454 // адрес хранения времени работы приводов штор, 4 байта*3 контура
#define WM_LIGHT_SETTINGS_ADDRESS 1470 // адрес хранения настроек досветки, 13 байт
#define WM_SHADOW_SETTINGS_ADDRESS 1490 // адрес хранения настроек каналов штор, 10 байт*3 канала
#define WM_KEY_ADDRESS	1550 // адрес хранения регистрационного ключа, 10 байт

#define SYNC_SETTINGS_ADDRESS 1600 // адрес хранения настроек синхронизации времени, 60 байт
#define WM_CYCLE_SETTINGS_ADDRESS 1700 // адрес хранения настроек циркуляционной вентиляции, 16 байт*3 канала
#define WM_VENT_SETTINGS_ADDRESS  1800 // адрес хранения настроек вентиляции по температуре, 20 байт*3 канала
#define WM_THERMOSTAT_SETTINGS_ADDRESS  1900 // адрес хранения настроек термостатов, 10 байт*3 канала
#define WM_CO2_SETTINGS_ADDRESS 1930  // адрес хранения настроек контроля СО2, 16 байт*3 канала


// настройки хранения информации по GSM
#define GSM_PROVIDER_NAME_ADDRESS 2000 // адрес хранения имени провайдера, 20 байт, включая завершающий 0
#define GSM_APN_ADDRESS  2020 // адрес APN, 50 байт, включая завершающий 0
#define GSM_APN_USER_ADDRESS 2070 // адрес имени пользователя APN, 20 байт, включая завершающий 0
#define GSM_APN_PASS_ADDRESS 2090 // адрес пароля пользователя APN, 20 байт, включая завершающий 0
#define GSM_BALANCE_CUSD_ADDRESS 2110 // адрес хранения команды запроса баланса, 50 байт, включая завершающий 0

// адрес хранения привязок DS18B20 к адресам, максимум 100 записей, одна запись - 10 байт, т.е. отводится 1000 байт на это дело
#define DS18B20_BINDING_ADDRESS 2200

#define COMPOSITE_COMMANDS_START_ADDR 3248 // с четвёртого килобайта в EEPROM идут составные команды

#define EEPROM_RULES_START_ADDR 5120 // с пятого килобайта в EEPROM идут правила


#define CO2_BINDING_ADDRESS 10300 // тут хранятся привязки CO2 к железу, 100 байт (про запас)
#define PH_BINDING_ADDRESS 10400 // тут хранятся привязки pH к железу, 100 байт (про запас)
#define THERMOSTAT_BINDING_ADDRESS 10500 // тут хранятся привязки термостата к железу, 100 байт (про запас)
#define VENT_BINDING_ADDRESS 10600 // тут хранятся привязки вентиляции к железу, 100 байт (про запас)
#define CYCLE_VENT_BINDING_ADDRESS 10700 // тут хранятся привязки воздухообмена к железу, 100 байт (про запас)
#define SHADOW_BINDING_ADDRESS 10800 // тут хранятся привязки затенения к железу, 100 байт (про запас)
#define HEAT_BINDING_ADDRESS 10900 // тут хранятся привязки отопления к железу, 100 байт (про запас)
#define LIGHT_BINDING_ADDRESS 11000 // тут хранятся привязки досветки к железу, 100 байт (про запас)
#define RAIN_BINDING_ADDRESS 11100 // тут хранятся привязки датчика дождя к железу, 100 байт (про запас)
#define WIND_BINDING_ADDRESS 11200 // тут хранятся привязки датчика ветра к железу, 100 байт (про запас)
#define BUZZER_BINDING_ADDRESS 11300 // тут хранятся привязки пищалки к железу, 100 байт (про запас)
#define NRF_BINDING_ADDRESS 11400 // тут хранятся привязки nRF к железу, 20 байт (про запас)
#define LORA_BINDING_ADDRESS 11420 // тут хранятся привязки LoRa к железу, 20 байт (про запас)
#define TIMER_BINDING_ADDRESS 11440 // тут хранятся привязки таймеров к железу, 20 байт (про запас)
#define DALLAS_BINDING_ADDRESS 11500 // тут хранятся привязки DS18B20 к железу, 100 байт (про запас)
#define ONEWIRE_BINDING_ADDRESS 11600 // тут хранятся привязки DS18B20 к железу, 50 байт (про запас)
#define DIODES_BINDING_ADDRESS 11650 // тут хранятся привязки информационных диодов к железу, 20 байт (про запас)
#define WINDOWS_BINDING_ADDRESS 11700 // тут хранятся привязки фрамуг к железу, 100 байт (про запас)
#define ENDSTOPS_BINDING_ADDRESS 11800 // тут хранятся привязки концевиков к железу, 100 байт (про запас)
#define SOIL_BINDING_ADDRESS 11900 // тут хранятся привязки датчиков влажности почвы к железу, 100 байт (про запас)
#define HUMIDITY_BINDING_ADDRESS 12000 // тут хранятся привязки датчиков влажности к железу, 100 байт (про запас)
#define RS485_BINDING_ADDRESS 12100 // тут хранятся привязки RS-485 к железу, 50 байт (про запас)
#define WATERING_BINDING_ADDRESS 12150 // тут хранятся привязки полива к железу, 100 байт (про запас)
#define GSM_BINDING_ADDRESS 12250 // тут хранятся привязки SIM800 к железу, 100 байт (про запас)
#define WIFI_BINDING_ADDRESS 12350 // тут хранятся привязки ESP к железу, 100 байт (про запас)
#define TFT_BINDING_ADDRESS 12450 // тут хранятся привязки TFT к железу, 50 байт (про запас)
#define FLOW_BINDING_ADDRESS 12500 // тут хранятся привязки расходомеров к железу, 50 байт (про запас)
#define TFT_SENSORS_BINDING_ADDRESS 12550 // тут хранятся настройки датчиков TFT, 12 записей, по 50 байт каждая, итого - 600 байт
#define WPOWER_BINDING_ADDRESS 13200 // тут хранятся настройки для управления питанием фрамуг, 50 байт
#define DOOR_BINDING_ADDRESS 13300 // тут хранятся настройки привязок для управления дверьми, 100 байт
#define WM_DOOR_SETTINGS_ADDRESS 13400 // тут хранятся настройки управления дверями, 20 байт*2 канала = 40 байт
#define INTERVALS_BINDING_ADDRESS	14000 // тут хранятся настройки интервалов открытия окон, 16 окон*4 байта + 2 байта заголовка + CRC(1 байт) = 30 байт

//--------------------------------------------------------------------------------------------------------------------------------
// настройки Serial
//--------------------------------------------------------------------------------------------------------------------------------
#define SERIAL_BAUD_RATE 57600 // скорость работы с портами, бод (конфигуратор работает с портом именно на скорости 57600)
#define VIRTUAL_PIN_START_NUMBER 110 // номер пина, с которого все пины будут считаться виртуальными, т.е. запись в них производиться не будет, однако в карте пинов (16 байт) этот статус будет отражён.

//--------------------------------------------------------------------------------------------------------------------------------
// настройки максимумов
//--------------------------------------------------------------------------------------------------------------------------------
#define MAX_ALERT_RULES 50 // максимальное кол-во поддерживаемых правил
#define MAX_DELTAS 20 // максимальное кол-во дельт. Внимание: на 20 дельт нужно примерно 500 байт в EEPROM, следите за непересечением адресов!!!


//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// настройки TFT (используется экран с разрешением 800x480)
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// цвета для TFT
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define TFT_BACK_COLOR WHITE // цвет фона
#define TFT_BUTTON_COLORS WHITE, 0x8410, WHITE, 0xF800, 0x001F
#define TFT_FONT_COLOR 0x4A69 // цвет шрифта по умолчанию
#define TFT_CHANNELS_BUTTON_COLORS 0x3A8D, 0xC618, 0x8410, 0xF800, 0xEF7D // цвета кнопок для каналов
#define INFO_BOX_BACK_COLOR 0x6161 // цвет фона для информационного бокса
#define INFO_BOX_BORDER_COLOR BLACK // цвет рамки информационного бокса
#define INFO_BOX_CAPTION_COLOR 0x33D6 // цвет заголовка информационного бокса
#define SENSOR_BOX_FONT_COLOR WHITE // цвет показаний датчика
#define SENSOR_BOX_UNIT_COLOR WHITE // цвет единиц изменений датчика
#define MODE_ON_COLOR 0x0400   // цвет "вкл", "авто"
#define MODE_OFF_COLOR 0x8000 // цвет "выкл", "ручной"
#define CHANNELS_BUTTONS_TEXT_COLOR WHITE // цвет текста кнопок каналов
#define CHANNELS_BUTTONS_BG_COLOR 0xEF7D    // цвет фона кнопок каналов
#define CHANNEL_BUTTONS_TEXT_COLOR 0x3A8D   // цвет текста кнопки одного канала
#define TIME_PART_FONT_COLOR 0x0410 // цвет текста кнопки установки компонента времени
#define TIME_PART_SELECTED_FONT_COLOR WHITE // цвет текста активной кнопки компонента времени
#define TIME_PART_BG_COLOR 0xEF7D // цвет фона кнопки компонента времени
#define TIME_PART_SELECTED_BG_COLOR 0x0400 // цвет фона выбранной кнопки компонента времени
#define STATUS_ON_COLOR 0x07E0 // цвет статусов на экране ожидания
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// настройки подписей и пр.
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define TFT_WINDOW_STATUS_CAPTION "ФРАМУГИ"
#define TFT_WATER_STATUS_CAPTION "ПОЛИВ"
#define TFT_LIGHT_STATUS_CAPTION "ДОСВЕТКА"
#define TFT_STATUS_CAPTION "Статус:"
#define TFT_MODE_CAPTION "Режим:"
#define TFT_WINDOWS_OPEN_CAPTION "открыты"
#define TFT_WINDOWS_CLOSED_CAPTION "закрыты"
#define TFT_WATER_ON_CAPTION "вкл"
#define TFT_WATER_OFF_CAPTION "выкл"
#define TFT_LIGHT_ON_CAPTION "вкл"
#define TFT_LIGHT_OFF_CAPTION "выкл"
#define TFT_AUTO_MODE_CAPTION "авто"
#define TFT_MANUAL_MODE_CAPTION "ручной"
#define AUTO_MODE_LABEL "РЕЖИМ: АВТО"
#define MANUAL_MODE_LABEL "РЕЖИМ: РУЧНОЙ"
#define OPEN_ALL_LABEL "ОТКРЫТЬ ВСЕ"
#define CLOSE_ALL_LABEL "ЗАКРЫТЬ ВСЕ"
#define TURN_ON_ALL_WATER_LABEL "ВКЛ ПОЛИВ"
#define TURN_OFF_ALL_WATER_LABEL "ВЫКЛ ПОЛИВ"
#define SKIP_WATERING_LABEL "ПРОПУСТИТЬ"
#define TURN_ON_ALL_LIGHT_LABEL "СВЕТ ВКЛ"
#define TURN_OFF_ALL_LIGHT_LABEL "СВЕТ ВЫКЛ"
#define TFT_TOPEN_CAPTION "^ откр (для правил):"
#define TFT_TCLOSE_CAPTION "^ закр (для правил):"
#define TFT_INTERVAL_CAPTION "Время открытия, с:"
#define TFT_CURRENTTIME_CAPTION "Дата/время (выделите компонент для изменения):"
#define TFT_SENSOR_TEMPERATURE_CAPTION F("Температура #")
#define TFT_SENSOR_HUMIDITY_CAPTION F("Влажность #")
#define TFT_SENSOR_LUMINOSITY_CAPTION F("Освещенность #")
#define TFT_SENSOR_SOIL_CAPTION F("Почва #")
#define TFT_LIST_SCROLL_UP_CAPTION "ВВЕРХ"
#define TFT_LIST_SCROLL_DOWN_CAPTION "ВНИЗ"
#define TFT_TIME_SYNC_BUTTON_CAPTION "СИНХРОНИЗАЦИЯ ВРЕМЕНИ"
#define TFT_SYNC_ENABLED_CAPTION "ВКЛЮЧЕНА"
#define TFT_SYNC_DISABLED_CAPTION "ВЫКЛЮЧЕНА"
#define TFT_TIME_SYNC_GSM_INTERVAL_CAPTION "ИНТЕРВАЛ GSM, Ч:"
#define TFT_TIME_SYNC_WIFI_INTERVAL_CAPTION "ИНТЕРВАЛ WI-FI, Ч:"
#define TFT_TIMEZONE_BOX_CAPTION "ТАЙМЗОНА, МИНУТ:"
#define TFT_WATERING_SETT_CAPTION "НАСТРОЙКА"
#define TFT_WATERING_SETT_SCREEN_CAPTION "НАСТРОЙКА КАНАЛОВ ПОЛИВА"
#define TFT_WATERING_SETT_HUM_BORDER "ПОРОГ ВЛАЖНОСТИ:"
#define TFT_WATERING_SETT_SENSOR "ДАТЧИК ПОЧВЫ:"
#define TFT_WATERING_SETT_DURATION "ДЛИТЕЛЬНОСТЬ, МИН:"
#define TFT_WATERING_SETT_START "НАЧАЛО, Ч:"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
